Revit 2024 API
FamilyInstancePlacingArgs Class
 The class is used to access necessary data during the placement of a FamilyInstance.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FamilyInstancePlacingArgs : IDisposable
Visual Basic
Public Class FamilyInstancePlacingArgs _
	Implements IDisposable
Visual C++
public ref class FamilyInstancePlacingArgs : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.FamilyInstancePlacingArgs
See Also
FamilyInstancePlacingArgs Members
Autodesk.Revit.UI Namespace